Revit 2024 API
BuiltInFailures.TrussFailures.TrussInvalidSymbolGeom Property
 Truss is unable to generate any members due to layout family error.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId TrussInvalidSymbolGeom { get; }
Visual Basic
Public Shared ReadOnly Property TrussInvalidSymbolGeom As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ TrussInvalidSymbolGeom {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.TrussFailures Class
Autodesk.Revit.DB Namespace